/* 6806021411325 นายธนธรณ์ บุษเกตุ*/
#include <iostream> //นำเข้าไลบรารี iostream เพื่อใช้ในการรับและแสดงผลข้อมูล
using namespace std; //เรียกใช้ไลบรารี iostream และใช้ namespace std

int main(){ //ฟังก์ชันหลักของโปรแกรม
    float c, f ; //ประกาศตัวแปร c สำหรับอุณหภูมิในเซลเซียส และ f สำหรับอุณหภูมิในฟาเรนไฮต์
    cout << "Temperature Conversion Program" << endl; //แสดงข้อความหัวเรื่อง
    cout << "Enter temperature in Fahrenheit: "; //ขอให้ผู้ใช้ป้อนอุณหภูมิในฟาเรนไฮต์
    cin >> f; //รับค่าจากผู้ใช้และเก็บไว้ในตัวแปร f
    c = 5.00 / 9.00 * (f - 32) ; //แปลงอุณหภูมิจากฟาเรนไฮต์เป็นเซลเซียสโดยใช้สูตร c = 5/9 * (f - 32)
    cout << "---------------------------" << endl; //แสดงเส้นแบ่ง
    cout << "Temperature in Celsius: " << c << endl;//แสดงผลอุณหภูมิในเซลเซียส
    return 0; //คืนค่า 0 เพื่อบ่งชี้ว่าการทำงานของโปรแกรมสำเร็จ
} //จบโปรแกรม