/* 6806021411325 นายธนธรณ์ บุษเกตุ*/
#include <iostream> //นำเข้าไลบรารี iostream เพื่อใช้ในการรับและแสดงผลข้อมูล
using namespace std;    //เรียกใช้ไลบรารี iostream และใช้ namespace std

int main() { //ฟังก์ชันหลักของโปรแกรม
    cout << "Number Digit Program" << endl; //แสดงข้อความหัวเรื่อง
    int num;    //ประกาศตัวแปร num สำหรับเก็บตัวเลขที่ผู้ใช้ป้อน
    cout << "Enter number : ";  //ขอให้ผู้ใช้ป้อนตัวเลข
    cin >> num; //รับค่าจากผู้ใช้และเก็บไว้ในตัวแปร num
    int d1 = num / 1000; //คำนวณหลักพัน 
    int d2 = (num / 100) % 10; //คำนวณหลักร้อย
    int d3 = (num / 10) % 10;// คำนวณหลักสิบ
    int d4 = num % 10; //คำนวณหลักหน่วย

    cout << d1 << "   " << d2 << "   " << d3 << "   " << d4 << endl; //แสดงผลหลักพัน, ร้อย, สิบ, หน่วย
    return 0;// คืนค่า 0 เพื่อบ่งชี้ว่าการทำงานของโปรแกรมสำเร็จ
}//จบโปรแกรม