/* 6806021411325 นายธนธรณ์ บุษเกตุ*/
#include <iostream> //นำเข้าไลบรารี iostream เพื่อใช้ในการรับและแสดงผลข้อมูล
using namespace std;    //เรียกใช้ไลบรารี iostream และใช้ namespace std

int main() { //ฟังก์ชันหลักของโปรแกรม
    int binary; //ประกาศตัวแปร binary สำหรับเก็บค่าตัวเลขฐานสองที่ผู้ใช้ป้อน
    cout << "Binary to Decimal Conversion Program" << endl; //แสดงข้อความหัวเรื่อง
    cout << "Enter binary number : "; //ขอให้ผู้ใช้ป้อนตัวเลขฐานสอง
    cin >> binary; //รับค่าจากผู้ใช้และเก็บไว้ในตัวแปร binary

    int decimal = 0, base = 1; //ประกาศตัวแปร decimal สำหรับเก็บค่าตัวเลขฐานสิบ และ base สำหรับคำนวณค่าพื้นฐาน
    int temp = binary; //เก็บค่าตัวเลขฐานสองในตัวแปร temp เพื่อใช้ในการคำนวณ
    while (temp > 0) { //ลูปเพื่อแปลงค่าจากฐานสองเป็นฐานสิบ
        int last_digit = temp % 10; //รับหลักสุดท้ายของตัวเลขฐานสอง
        decimal += last_digit * base; //เพิ่มค่าของหลักสุดท้ายคูณกับฐานปัจจุบันไปยังตัวแปร decimal
        base *= 2; //เพิ่มค่าของฐานเป็นสองเท่าเพื่อเตรียมสำหรับหลักถัดไป
        temp /= 10; //ลบหลักสุดท้ายออกจากตัวเลขฐานสอง
    }

    cout << "Decimal value of " << binary << " = " << decimal << endl;//แสดงผลค่าตัวเลขฐานสิบที่แปลงได้ 
    return 0;// คืนค่า 0 เพื่อบ่งชี้ว่าการทำงานของโปรแกรมสำเร็จ
}//จบโปรแกรม