// 6806021411325 นายธนธรณ์ บุษเกตุ
#include <iostream> //นำเข้าไลบรารี iostream เพื่อใช้ฟังก์ชันการป้อนและแสดงผลข้อมูล
#define PI 3.14159F // กำหนดค่าคงที่ PI สำหรับการคำนวณพื้นที่วงกลม
using namespace std;    // ใช้ namespace std เพื่อไม่ต้องใช้ std:: ก่อนชื่อฟังก์ชันและตัวแปรในไลบรารีมาตรฐาน

float calCircle(); // ประกาศฟังก์ชันสำหรับคำนวณพื้นที่วงกลม
float calRectangle(); // ประกาศฟังก์ชันสำหรับคำนวณพื้นที่วงกลมและสี่เหลี่ยมผืนผ้า
float calTriangle(); // ประกาศฟังก์ชันสำหรับคำนวณพื้นที่สามเหลี่ยม
float calExit(); // ประกาศฟังก์ชันสำหรับออกจากโปรแกรม

int main(){  // ฟังก์ชันหลักของโปรแกรม
    char Choice;    // ประกาศตัวแปร Choice สำหรับเก็บตัวเลือกของผู้ใช้
    float Area;     // ประกาศตัวแปร Area สำหรับเก็บพื้นที่ที่คำนวณได้
    cout << "Program Calculate Area" << endl;
    cout << "1,C,c      : Circle" << endl;    // แสดงตัวเลือกให้ผู้ใช้เลือก circle
    cout << "2,R,r      : Rectangle" << endl;  // แสดงตัวเลือกให้ผู้ใช้เลือก rectangle
    cout << "3,T,t      : Triangle" << endl;  // แสดงตัวเลือกให้ผู้ใช้เลือก triangle
    cout << "4,E,X,e,x  : Exit" << endl;  // แสดงตัวเลือกให้ผู้ใช้เลือก exit
    cout << "Enter your choice number : ";  // แสดงข้อความให้ผู้ใช้เลือกตัวเลือก
    cin >> Choice;  // รับค่าตัวเลือกจากผู้ใช้
    
    if(Choice == '1' || Choice == 'C' || Choice == 'c') {  // ตรวจสอบว่าผู้ใช้เลือกตัวเลือกสำหรับวงกลมหรือไม่
        calCircle(); // เรียกใช้ฟังก์ชัน calCircle เพื่อคำนวณพื้นที่วงกลม
    } else if(Choice == '2' ||  Choice == 'R' || Choice == 'r'){  // ตรวจสอบว่าผู้ใช้เลือกตัวเลือกสำหรับสี่เหลี่ยมผืนผ้าหรือไม่
        calRectangle(); // เรียกใช้ฟังก์ชัน calRectangle เพื่อคำนวณพื้นที่สี่เหลี่ยมผืนผ้า
    } else if(Choice == '3' || Choice == 'T' || Choice == 't'){  // ตรวจสอบว่าผู้ใช้เลือกตัวเลือกสำหรับสามเหลี่ยมหรือไม่
        calTriangle(); // เรียกใช้ฟังก์ชัน calTriangle เพื่อคำนวณพื้นที่สามเหลี่ยม
    } else if(Choice == '4' || Choice == 'E' || Choice == 'X' || Choice == 'e' || Choice == 'x') {  // ตรวจสอบว่าผู้ใช้เลือกตัวเลือกสำหรับออกจากโปรแกรมหรือไม่
        calExit(); // เรียกใช้ฟังก์ชัน calExit เพื่อออกจากโปรแกรม
    } 
    return 0;// คืนค่า 0  เพื่อบ่งชี้ว่าโปรแกรมทำงานสำเร็จ

} // จบฟังก์ชันหลัก

float calCircle() {  // ฟังก์ชันสำหรับคำนวณพื้นที่วงกลม
    float Area;  // ประกาศตัวแปรสำหรับเก็บพื้นที่
     float Radius;  // ประกาศตัวแปรสำหรับเก็บรัศมีของวงกลม
        cout << "\nEnter Radius : ";  // ขอให้ผู้ใช้ป้อนค่ารัศมีของวงกลม
        cin >> Radius;  // รับค่ารัศมีจากผู้ใช้
        Area = PI * Radius * Radius;    // คำนวณพื้นที่วงกลมโดยใช้สูตร PI * Radius * Radius
        cout << "Area of Circle = " << Area << endl; // แสดงผลพื้นที่วงกลม
        return Area;  // คืนค่าพื้นที่วงกลม
}

float calRectangle() { // ฟังก์ชันสำหรับคำนวณพื้นที่สี่เหลี่ยมผืนผ้า
    float Area;        // ประกาศตัวแปรสำหรับเก็บพื้นที่
    float Length, Width;  // ประกาศตัวแปรสำหรับความยาวและความกว้างของสี่เหลี่ยมผืนผ้า
    cout << "\nEnter Length : ";  // ขอให้ผู้ใช้ป้อนค่าความยาวของสี่เหลี่ยมผืนผ้า
    cin >> Length;  // รับค่าความยาวจากผู้ใช้
    cout << "Enter Width : ";  // ขอให้ผู้ใช้ป้อนค่าความกว้างของสี่เหลี่ยมผืนผ้า
    cin >> Width;   // รับค่าความกว้างจากผู้ใช้
    Area = Length * Width;  // คำนวณพื้นที่สี่เหลี่ยมผืนผ้าโดยใช้สูตร ความยาว * ความกว้าง
    cout << "Area of Rectangle = " << Area << endl;  // แสดงผลพื้นที่สี่เหลี่ยมผืนผ้า
    return Area;    // คืนค่าพื้นที่สี่เหลี่ยมผืนผ้า
}

float calTriangle() { // ฟังก์ชันสำหรับคำนวณพื้นที่สามเหลี่ยม
    float Area;  // ประกาศตัวแปรสำหรับเก็บพื้นที่
    float Base, Height;  // ประกาศตัวแปรสำหรับฐานและความสูงของสามเหลี่ยม
    cout << "\nEnter Base : ";  // ขอให้ผู้ใช้ป้อนค่าฐานของสามเหลี่ยม
    cin >> Base;  // รับค่าฐานจากผู้ใช้
    cout << "Enter Height : ";  // ขอให้ผู้ใช้ป้อนค่าความสูงของสามเหลี่ยม
    cin >> Height;  // รับค่าความสูงจากผู้ใช้
    Area = 0.5 * Base * Height;  // คำนวณพื้นที่สามเหลี่ยมโดยใช้สูตร 1/2 * ฐาน * ความสูง
    cout << "Area of Triangle = " << Area << endl; // แสดงผลพื้นที่สามเหลี่ยม 
    return Area;  // คืนค่าพื้นที่สามเหลี่ยม
}

float calExit() { // ฟังก์ชันสำหรับออกจากโปรแกรม
    cout << "Exit Program" << endl; // ฟังก์ชันสำหรับออกจากโปรแกรม
    return 0; // ไม่มีการคำนวณพื้นที่ในฟังก์ชันนี้ แต่ใช้เพื่อแสดงข้อความและออกจากโปรแกรม
} 
