#include <iostream>
#include <string>

using namespace std;

int main(){
    char Ch; // ประกาศตัวแปร Ch สำหรับเก็บตัวอักษรที่ผู้ใช้ป้อนเข้าม
    int  Count = 0; // ประกาศตัวแปร Count สำหรับนับจำนวนตัวอักษรที่ป้อนเข้ามา
    string Str; // ประกาศตัวแปร Str สำหรับเก็บข้อความที่ผู้ใช้ป้อนเข้ามา

    cout << "Enter String : "; // แสดงข้อความให้ผู้ใช้ป้อนข้อความ

    while ((Ch = cin.get()) != '\n')   // ใช้ลูป while เพื่อรับตัวอักษรจากผู้ใช้จนกว่าจะเจอการกด Enter (ขึ้นบรรทัดใหม่) 
    {
        Count ++; // เพิ่มค่าตัวแปร Count ทุกค รั้งที่ผู้ใช้ป้อนตัวอักษร
        Str += Ch; // เพิ่มตัวอักษรที่ผู้ใช้ป้อนเข้ามาในตัวแปร str
    }
    cout << "Length of String : " << Str << " is " << Count << endl;  // แสดงผลความยาวของข้อความที่ผู้ใช้ป้อนเข้ามา
    
    return 0;
}