 // 6806021411325 นายธนธรณ์ บุษเกตุ
#include <iostream>  // นำเข้าไลบรารี iostream เพื่อใช้ฟังก์ชันการป้อนและแสดงผลข้อมูล
#include <string>  // นำเข้าไลบรารี string เพื่อใช้ตัวแปรแบบสตริง
using namespace std;  // ใช้ namespace std เพื่อไม่ต้องใช้ std:: ก่อนชื่อฟังก์ชันและตัวแปรในไลบรารีมาตรฐาน

int main() {  // ฟังก์ชันหลักของโปรแกรม
    char Ch; // ประกาศตัวแปร Ch สำหรับเก็บตัวอักษรที่ผู้ใช้ป้อนเข้าม
    int digit = 0, space = 0, upper = 0, lower = 0, symbol = 0, dot = 0, other = 0,  total = 0;    // ประกาศตัวแปรสำหรับนับจำนวนประเภทต่าง ๆ ของตัวอักษรที่ป้อนเข้ามา
    string Str;  // ประกาศตัวแปร Str สำหรับเก็บข้อความที่ผู้ใช้ป้อนเข้ามา

    cout << "Enter String : ";  // แสดงข้อความให้ผู้ใช้ป้อนข้อความ

    while ((Ch = cin.get()) != '\n') {  // ใช้ลูป while เพื่อรับตัวอักษรจากผู้ใช้จนกว่าจะเจอการกด Enter (ขึ้นบรรทัดใหม่)
        total++;  // เพิ่มค่าตัวแปร total ทุกครั้งที่ผู้ใช้ป้อนตัวอักษร
        Str += Ch;  // เพิ่มตัวอักษรที่ผู้ใช้ป้อนเข้ามาในตัวแปร Str
        if (Ch >= '0' && Ch <= '9')     // ตรวจสอบว่าตัวอักษรที่ป้อนเข้ามาเป็นตัวเลขหรือไม่
            digit++;        // ถ้าใช่ เพิ่มค่าตัวแปร digit    
        else if (Ch == ' ')     // ตรวจสอบว่าตัวอักษรที่ป้อนเข้ามาเป็นช่องว่างหรือไม่
            space++;        // ถ้าใช่ เพิ่มค่าตัวแปร space
        else if (Ch >= 'A' && Ch <= 'Z')        // ตรวจสอบว่าตัวอักษรที่ป้อนเข้ามาเป็นตัวอักษรพิมพ์ใหญ่หรือไม่
            upper++;        // ถ้าใช่ เพิ่มค่าตัวแปร upper
        else if (Ch >= 'a' && Ch <= 'z')        // ตรวจสอบว่าตัวอักษรที่ป้อนเข้ามาเป็นตัวอักษรพิมพ์เล็กหรือไม่
            lower++;        // ถ้าใช่ เพิ่มค่าตัวแปร lower
        else if (Ch == '(' || Ch == ')' || Ch == '+' || Ch == '-' || Ch == '*' || Ch == '/' || Ch == '[' || Ch == ']')      // ตรวจสอบว่าตัวอักษรที่ป้อนเข้ามาเป็นสัญลักษณ์พิเศษหรือไม่
            symbol++;     // ถ้าใช่ เพิ่มค่าตัวแปร symbol
        else if (Ch == '.')     // ตรวจสอบว่าตัวอักษรที่ป้อนเข้ามาเป็นจุดทศนิยมหรือไม่
            dot++;      // ถ้าใช่ เพิ่มค่าตัวแปร dot
        else        // ถ้าตัวอักษรที่ป้อนเข้ามาไม่ตรงกับเงื่อนไขข้างต้น
            other++;        // เพิ่มค่าตัวแปร other เพื่อเก็บจำนวนตัวอักษรที่ไม่ตรงกับเงื่อนไขใด ๆ
    }      // จบลูป while

    
    cout << "Digits: " << digit << endl;                // แสดงผลจำนวนตัวเลขที่ผู้ใช้ป้อนเข้ามา
    cout << "Spaces: " << space << endl;                // แสดงผลจำนวนช่องว่างที่ผู้ใช้ป้อนเข้าม
    cout << "A-Z: " << upper << endl;                   // แสดงผลจำนวนตัวอักษรพิมพ์ใหญ่ที่ผู้ใช้ป้อนเข้าม
    cout << "a-z: " << lower << endl;                   // แสดงผลจำนวนตัวอักษรพิมพ์เล็กที่ผู้ใช้ป้อนเข้าม
    cout << "Symbols ()+-*/[]: " << symbol << endl;     // แสดงผลจำนวนสัญลักษณ์พิเศษที่ผู้ใช้ป้อนเข้าม
    cout << "Dot (.): " << dot << endl;                 // แสดงผลจำนวนจุดทศนิยมที่ผู้ใช้ป้อนเข้าม
    cout << "Other: " << other << endl;                 // แสดงผลจำนวนตัวอักษรอื่น ๆ ที่ผู้ใช้ป้อนเข้าม
    cout << "Total characters: " << total << endl;      // แสดงผลจำนวนตัวอักษรทั้งหมดที่ผู้ใช้ป้อนเข้าม

    return 0;       // คืนค่า 0 เพื่อบ่งชี้ว่าโปรแกรมทำงานสำเร็จ
}  // จบฟังก์ชันหลัก