#include <iostream>      // ใช้สำหรับรับค่าและแสดงผลทางหน้าจอ

using namespace std;     // เรียกใช้งานlibrary

int main() // ฟังก์ชันหลักของโปรแกรม
{ // เปิดบล็อกของฟังก์ชัน main
    cout << "Enter price : "; // แสดงข้อความให้ผู้ใช้ป้อนราคาสินค้า
    double price; // ประกาศตัวแปรชนิดทศนิยมสำหรับเก็บราคาสินค้า
    cin >> price; // รับค่าราคาสินค้าจากผู้ใช้

    cout << "Enter vat (%) : "; // แสดงข้อความให้ผู้ใช้ป้อนอัตราภาษีมูลค่าเพิ่ม
    double vat_percent; // ประกาศตัวแปรชนิดทศนิยมสำหรับเก็บอัตราภาษีมูลค่าเพิ่ม (ร้อยละ)
    cin >> vat_percent; // รับค่าอัตราภาษีมูลค่าเพิ่มจากผู้ใช้

    double net_price = price + (price * vat_percent / 100); // คำนวณราคาสินค้ารวมภาษีมูลค่าเพิ่ม

    cout << "Net Price of product = " << net_price << endl; // แสดงผลลัพธ์ราคาสินค้ารวมภาษี

    return 0; // จบการทำงานของโปรแกรม
} // ปิดบล็อกของฟังก์ชัน main